--牌结构
local static_cards = {
    114, 116, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113,
    214, 216, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213,
    314, 316, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313,
    414, 416, 403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413,
    521, 522,
    114, 116, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113,
    214, 216, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213,
    314, 316, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313,
    414, 416, 403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413,
    521, 522
}

--记录用户每局输赢信息
--应该尽量少向用户p上加字段数据,如果优化和修改，
-- -- 需要在一开始的时候就声明一个table插入数据
local users_score = {
    [1] = {
        master = '',
        rate_max = '',
        bomb_count = 0,
        uid_scores = {}
    }
}
users_score[1].uid_scores = {
    uid = '',
    cur_socre = 0,
    score = 0, --累加的
    bomb_count = 0,
    remain_cards = {}
}

--数据格式定义,很重要
local used_cards = {
    [1] = {
        [1] = 1, --牌型1单，2对子,3...
        [2] = { 101, 102, 302 }, --普通牌
        [3] = { 521, 111, 521, 111 }, --{王牌，转换后的牌}
        [4] = 6, --最大值,33445566最大值6
        [5] = 4, --长度,33445566最大值4
        [6] = "" --uid
    }
}
--座位信息
local player
local seats = {
    [1] = player,
    [2] = player,
    [3] = player,
    [4] = player
} --对应牌为user_cards[1-4]


--每一局结算消息结构
local uid_score = {
    'uid', '剩余牌数量', '出牌炸弹数量', '当局积分胜负',
    'uid', '剩余牌数量', '出牌炸弹数量', '当局积分胜负' --四条
}
local result = {
    master = 'master.uid', --master.uid
    count = 4, --人数
    infos = uid_score,
    cards = {} --按照当前文档是不需要的
}
--举例
local GameResult = {
    master = 7002,
    count = 4,
    infos = {
        7001, 25, 0, 2,
        7002, 33, 0, -6,
        7003, 0, 0, 2,
        7004, 25, 0, 2
    },
    cards = {}
}

--完成所有牌局返回总结算
local GameLandlordEnd = {
    [1] = {
        totalscore = -1.0,
        uid = 7004,
        nickname = "用户7004",
        wincount = 0,
        maxscore = 2.0,
        bombcount = 0,
    }
}


