--http://www.runoob.com/lua/lua-tutorial.html
--2017年11月6日11:20:22
--牛虻
-- this is 注释
print("-------->注释")
--[[
都是注释
]] --
--[=[
doc:test
]=] --
print("-------->string")
print("hello world!");
name = "牛虻"
print(name .. " uuu"); -->字符串链接

html = [[
<html>
<head></head>
<body>
    <a href="http://www.runoob.com/">菜鸟教程</a>
</body>
</html>
]]
print(html)
print("html字符串长度" .. #html)

print("-------->数值")
print(1.950251);
print(1.2 * "3"); -->数值

print(type(false)); -->boolean

print(type(x)) -->nil
print(type(type(x)))

print("-------->table，类似数据库表，erlang record, key是下标或者字符串")
local table1 = {}
local table2 = { "a", "b", "c", "d", "d", 1 }
table2[22] = "aa"
table2["key"] = "value"
for k, v in pairs(table2) do
    print(k .. ":" .. v)
end
print(table2.key);
print(table2["key"]);
print(table2[1]); -->下标1开始



print("-------->function函数与匿名函数")
local function sayHelloFun(n)
    if type(n) == 'number' then return "number"
    else
        return "not number"
    end
end

print(sayHelloFun("a"))
print(sayHelloFun(1))

local function sayHelloFun(n, fun)
    if type(n) == 'number' then return fun(n)
    else
        return "not number"
    end
end

function numberCount(n)
    return n % n
end

print(sayHelloFun("a"))
print(sayHelloFun(1, numberCount))


print("--------->变量与赋值")
a = 1
local b = 2
print(a, b)
a, b = b, a -->交换值
print(a, b)

local x, y, z = 0, 1, 2 -->多变量同时赋值,不赋值都是nil
print(x, y, y)


print("--------->运算符,算数，关系，逻辑，其他")
print(true and false)
print(false or true)
print(not true)
print("..运算符" .. "")
print("#求字符串或表的长度" .. #{ 1, 2, 3 })
--文件追加测试11/07/17 11:09:48
--文件追加测试11/07/17 11:09:48
--文件追加测试11/07/17 11:09:48
--文件追加测试11/07/17 11:10:56
--文件追加测试11/07/17 11:12:01
--文件追加测试11/07/17 11:12:02
--文件追加测试11/07/17 11:12:09
--文件追加测试11/07/17 11:12:16
--文件追加测试11/07/17 11:12:21
--文件追加测试11/07/17 11:12:22
--文件追加测试11/07/17 11:12:22
--文件追加测试11/07/17 11:12:23
--文件追加测试11/07/17 11:12:23
--文件追加测试11/07/17 11:12:25
--文件追加测试11/07/17 11:12:31
--文件追加测试11/07/17 11:13:31
--文件追加测试11/07/17 11:14:25
--文件追加测试11/07/17 11:14:30
--文件追加测试11/07/17 11:14:30
--文件追加测试11/07/17 11:14:30
--文件追加测试11/07/17 11:14:31
--文件追加测试11/07/17 11:14:58
--文件追加测试11/07/17 11:15:06
--文件追加测试11/07/17 11:15:32
--文件追加测试11/07/17 11:17:24
--文件追加测试11/07/17 11:17:48
--文件追加测试11/07/17 11:18:45
--文件追加测试11/07/17 11:20:57
--文件追加测试11/07/17 11:21:02
--文件追加测试11/07/17 11:25:42
--文件追加测试11/07/17 11:35:07
--文件追加测试11/07/17 11:35:20
--文件追加测试11/07/17 11:35:20
--文件追加测试11/07/17 11:35:21
--文件追加测试11/07/17 11:35:21
--文件追加测试11/07/17 11:35:22
--文件追加测试11/07/17 11:35:22
--文件追加测试11/07/17 11:35:23
--文件追加测试11/07/17 11:36:46
--文件追加测试11/07/17 11:36:57
--文件追加测试11/07/17 11:37:11
--文件追加测试11/07/17 11:38:41
--文件追加测试11/07/17 11:38:52
--文件追加测试11/07/17 11:40:01
--文件追加测试11/07/17 11:42:49
--文件追加测试11/07/17 11:42:54
--文件追加测试11/07/17 11:42:57
--文件追加测试11/07/17 11:45:17
--文件追加测试11/07/17 11:45:33
--文件追加测试11/07/17 11:45:49
--文件追加测试11/07/17 11:46:00
--文件追加测试11/07/17 11:47:04
--文件追加测试11/07/17 11:47:09
--文件追加测试11/07/17 11:47:20
--文件追加测试11/07/17 11:47:21
--文件追加测试11/07/17 11:47:22
--文件追加测试11/07/17 11:47:22
--文件追加测试11/07/17 11:47:22
--文件追加测试11/07/17 11:48:42
--文件追加测试11/07/17 11:48:50
--文件追加测试11/07/17 13:42:21
--文件追加测试11/07/17 13:46:10
--文件追加测试11/07/17 13:48:05
--文件追加测试11/07/17 13:48:14
--文件追加测试11/07/17 13:49:10
--文件追加测试11/07/17 13:49:11
--文件追加测试11/07/17 13:49:11
--文件追加测试11/07/17 13:49:11
--文件追加测试11/07/17 13:49:11
--文件追加测试11/07/17 13:51:02
--文件追加测试11/07/17 13:52:01
--文件追加测试11/07/17 13:52:07
--文件追加测试11/07/17 13:52:23
--文件追加测试11/07/17 13:52:29
--文件追加测试11/07/17 13:52:55
--文件追加测试11/07/17 13:53:42
--文件追加测试11/07/17 13:53:54
--文件追加测试11/07/17 13:54:05
--文件追加测试11/07/17 13:54:12
--文件追加测试11/07/17 13:54:19
--文件追加测试11/07/17 13:55:45
--文件追加测试11/07/17 13:56:02
--文件追加测试11/08/17 09:30:14
--文件追加测试11/08/17 09:30:20
